---
kind: property
id: P:Autodesk.Revit.DB.FabricationRodInfo.CanRodsBeHosted
source: html/4ee179bc-4345-82e0-258b-5f40a15e5948.htm
---
# Autodesk.Revit.DB.FabricationRodInfo.CanRodsBeHosted Property

Controls whether the hanger's rod's will be automatically hosted by other elements.

## Syntax (C#)
```csharp
public bool CanRodsBeHosted { get; set; }
```